[
	{
		"id": "gclc",
		"title": "Genesee County Literacy Coalition",
		"address": "711 N Saginaw St, Flint, MI 48503",
		"url": "https://www.gclcliteracy.org/about-gclc",
		"email": "info@gclc-mi.org",
		"phone": "(810) 238-4773",
		"description": "The Genesee County Literacy Coalition offers GED preparation classes and tutoring services for adults, including underserved women. They provide individualized support to help students improve their skills in reading, writing, math, science, and social studies, ultimately preparing them to successfully pass the GED exam."
	},
	{
		"id": "mcc",
		"title": "Mott Community College - Adult Basic Education/GED Program",
		"address": "709 N. Saginaw St., Flint, MI 48503",
		"url": "https://www.mcc.edu/wfed/adult-education.shtml",
		"email": "inquiry@mcc.edu",
		"phone": "(810) 232-2555",
		"description": "Mott Community College offers Adult Basic Education and GED preparation programs for individuals seeking to earn their high school equivalency diploma. Their program caters to underserved populations, including women, providing instruction in core subjects and test-taking strategies to help students successfully pass the GED exam."
	},
	{
		"id": "ywca",
		"title": "YWCA Greater Flint - Women's Education Center",
		"address": "310 E Third St, Flint, MI 48502",
		"url": "https://www.ywcaflint.org/",
		"email": "info@ywcaflint.org",
		"phone": "(810) 238-7621",
		"description": "The YWCA Greater Flint's Women's Education Center offers GED preparation classes and support services tailored to the needs of underserved women in Genesee County. In addition to academic instruction, they provide counseling, childcare assistance, and other resources to help women overcome barriers to education and achieve their GED goals."
	},
	{
		"id": "goodwill",
		"title": "Goodwill Industries of Mid-Michigan - GED/Adult Education Program",
		"address": "501 S Averill Ave, Flint, MI 48506",
		"url": "https://www.goodwillmidmichigan.org/",
		"email": "info@goodwillmidmichigan.org",
		"phone": "(810) 762-9960",
		"description": "Goodwill Industries of Mid-Michigan offers GED and adult education programs designed to empower underserved individuals, including women, through education and skill-building. Their program provides flexible scheduling, personalized instruction, and support services to help participants prepare for the GED exam and improve their employment prospects."
	},
	{
		"id": "flint-schools",
		"title": "Flint Community Schools - Adult Education/GED Program",
		"address": "923 E Kearsley St, Flint, MI 48503",
		"url": "https://www.flintschools.org/adulted",
		"email": "adulted@flintschools.org",
		"phone": "(810) 767-6030",
		"description": "Flint Community Schools offers Adult Education and GED preparation programs for adults, including underserved women, who are looking to complete their high school education. Their program provides flexible class schedules, experienced instructors, and a supportive learning environment to help students achieve success on the GED exam and beyond."
	}
]
